#ЗАДАЧА «МИНИМУМ ИЗ ДВУХ ЧИСЕЛ»
"""
a=7
b=10
if a<10:
    m=a;
 
    
print(m)
"""
"""
#ЗАДАЧА «ЗНАК ЧИСЛА»

#x=int(input())

#if x >0:
    print(1);
#elif x <0:
    print(-1);
#else: 
    print (0)
"""
#3. ЗАДАЧА «ШАХМАТНАЯ ДОСКА»
"""
x1 = int(input("введите число a"))
y1 = int(input("введите число b"))

x2 = int(input("введите число a"))
y2= int(input("введите число b"))
if (x1+y1)%2 == 0 and (x2+y2)%2 == 0 or (x1+y1)%2!= 0 and (x2+y2)%2!= 0:
    print ("одного цвета ")
else:

    print ("разного")
    
    
"""
#4. ЗАДАЧА «ВИСОКОСНЫЙ ГОД»
"""
g =int(input("введите число a "))
if g%4==0 or g%400==0 : 
    print ("YES");
else:
 
    print ("NO")
    """
#5. ЗАДАЧА «МИНИМУМ ИЗ ТРЕХ ЧИСЕЛ»
"""
a = 7
b = 9
c = 1
if c<b or c<a:
    m = c;
    print (m)
    """
#6. ЗАДАЧА «СКОЛЬКО СОВПАДАЕТ ЧИСЕЛ»

"""

n1=int(input("вводи твое число "));
n2=int(input("вводи твое число "))
n3=int(input("вводи твое число "))
if n1 !=n2 and n1 != n3:
    print (0);
if n1==n2 and n2!=n3 and n1!= n3:
        print (1);
if n1==n2==n3:
            print(3)
            """
#7. ЗАДАЧА «ХОД ЛАДЬИ»
"""
x1 = int(input("первая координата  квадрата х "))
y1 = int(input("вторая координата  квадрата y "))

x2 = int(input("первая координата  квадрата x "))
y2 = int(input("вторая координата  квадрата y "))
if x1 == x2 or y1 == y2:# пара из координат должны быть равны
    print("YES")
else:
    print("NO")
    
"""
#8. ЗАДАЧА «ХОД КОРОЛЯ»
"""
x1 = int(input("первая координата квадрата х "))
y1 = int(input("вторая координата квадрата y "))
         
x2 = int(input("первая координата  квадрата x "))
y2 = int(input("вторая координата  квадрата y "))
if  abs(x1-x2) > 1 or abs(y1-y2) > 1:# король ходит на одну клетку
    print("NO")
else:
    print("YES")
    """
#10. ЗАДАЧА «ХОД ФЕРЗЯ»
"""
x1 = int(input("координата первая квадрата х "))
y1 = int(input("координата вторая квадрата y "))
         
x2 = int(input("координата первая квадрата x "))
y2 = int(input("координата вторая квадрата y "))
if abs(x1-x2)==abs(y1-y2):
    print("может")
else:
    print("не может")
    """
 
